//Напишите программу, которая выводит третью цифру (справа налево) заданного числа и
//ли сообщает, что третьей цифры нет.
//645 -> 6
//78 -> третьей цифры нет
//32679 -> 6

Console. Write("Введите число: ");
int num = int.Parse(Console.ReadLine());
int three =  Math.Abs(num/100%10); //Модуль результата

if (three==0)
{
   Console.WriteLine("Третьей цифры нет"); 
}
else
{
    Console.WriteLine($"Третья цифра числа : {three}");
}

