//Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
//456 -> 5, 782 -> 8, 918 -> 1

int num = new Random().Next(100, 1000); //Задать случайное число от 10 до 999 включительно [a,b)

int second = num/10%10;

Console.WriteLine(num);

Console.WriteLine(second);
